[
  {"id":"barbitoffSystematicBenchmarkStateoftheart2022","abstract":"Abstract\n            \n              Background\n              Accurate variant detection in the coding regions of the human genome is a key requirement for molecular diagnostics of Mendelian disorders. Efficiency of variant discovery from next-generation sequencing (NGS) data depends on multiple factors, including reproducible coverage biases of NGS methods and the performance of read alignment and variant calling software. Although variant caller benchmarks are published constantly, no previous publications have leveraged the full extent of available gold standard whole-genome (WGS) and whole-exome (WES) sequencing datasets.\n            \n            \n              Results\n              In this work, we systematically evaluated the performance of 4 popular short read aligners (Bowtie2, BWA, Isaac, and Novoalign) and 9 novel and well-established variant calling and filtering methods (Clair3, DeepVariant, Octopus, GATK, FreeBayes, and Strelka2) using a set of 14 \"gold standard\" WES and WGS datasets available from Genome In A Bottle (GIAB) consortium. Additionally, we have indirectly evaluated each pipeline's performance using a set of 6 non-GIAB samples of African and Russian ethnicity. In our benchmark, Bowtie2 performed significantly worse than other aligners, suggesting it should not be used for medical variant calling. When other aligners were considered, the accuracy of variant discovery mostly depended on the variant caller and not the read aligner. Among the tested variant callers, DeepVariant consistently showed the best performance and the highest robustness. Other actively developed tools, such as Clair3, Octopus, and Strelka2, also performed well, although their efficiency had greater dependence on the quality and type of the input data. We have also compared the consistency of variant calls in GIAB and non-GIAB samples. With few important caveats, best-performing tools have shown little evidence of overfitting.\n            \n            \n              Conclusions\n              The results show surprisingly large differences in the performance of cutting-edge tools even in high confidence regions of the coding genome. This highlights the importance of regular benchmarking of quickly evolving tools and pipelines. We also discuss the need for a more diverse set of gold standard genomes that would include samples of African, Hispanic, or mixed ancestry. Additionally, there is also a need for better variant caller assessment in the repetitive regions of the coding genome.","accessed":{"date-parts":[["2023",5,24]]},"author":[{"family":"Barbitoff","given":"Yury A."},{"family":"Abasov","given":"Ruslan"},{"family":"Tvorogova","given":"Varvara E."},{"family":"Glotov","given":"Andrey S."},{"family":"Predeus","given":"Alexander V."}],"citation-key":"barbitoffSystematicBenchmarkStateoftheart2022","container-title":"BMC Genomics","container-title-short":"Bmc Genomics","DOI":"10.1186/s12864-022-08365-3","ISSN":"1471-2164","issue":"1","issued":{"date-parts":[["2022",12]]},"language":"en-US","page":"155","source":"BioMed Central","title":"Systematic benchmark of state-of-the-art variant calling pipelines identifies major factors affecting accuracy of coding sequence variant discovery","type":"article-journal","URL":"https://doi.org/10.1186/s12864-022-08365-3","volume":"23"},
  {"id":"cuiMiniSNVAccurateFast2024","abstract":"Nanopore sequence technology has demonstrated a longer read length and enabled to potentially address the limitations of short-read sequencing including long-range haplotype phasing and accurate variant calling. However, there is still room for improvement in terms of the performance of single nucleotide variant (SNV) identification and computing resource usage for the state-of-the-art approaches. In this work, we introduce miniSNV, a lightweight SNV calling algorithm that simultaneously achieves high performance and yield. miniSNV utilizes known common variants in populations as variation backgrounds and leverages read pileup, read-based phasing, and consensus generation to identify and genotype SNVs for Oxford Nanopore Technologies (ONT) long reads. Benchmarks on real and simulated ONT data under various error profiles demonstrate that miniSNV has superior sensitivity and comparable accuracy on SNV detection and runs faster with outstanding scalability and lower memory than most state-of-the-art variant callers. miniSNV is available from https://github.com/CuiMiao-HIT/miniSNV.","accessed":{"date-parts":[["2025",7,23]]},"author":[{"family":"Cui","given":"Miao"},{"family":"Liu","given":"Yadong"},{"family":"Yu","given":"Xian"},{"family":"Guo","given":"Hongzhe"},{"family":"Jiang","given":"Tao"},{"family":"Wang","given":"Yadong"},{"family":"Liu","given":"Bo"}],"citation-key":"cuiMiniSNVAccurateFast2024","container-title":"Briefings in Bioinformatics","container-title-short":"Briefings Bioinf.","DOI":"10.1093/bib/bbae473","ISSN":"1477-4054","issue":"6","issued":{"date-parts":[["2024",11,1]]},"language":"en","page":"bbae473","source":"Silverchair","title":"miniSNV: accurate and fast single nucleotide variant calling from nanopore sequencing data","title-short":"miniSNV","type":"article-journal","URL":"https://doi.org/10.1093/bib/bbae473","volume":"25"},
  {"id":"danecekTwelveYearsSAMtools2021","abstract":"Abstract\n            \n              Background\n              SAMtools and BCFtools are widely used programs for processing and analysing high-throughput sequencing data. They include tools for file format conversion and manipulation, sorting, querying, statistics, variant calling, and effect analysis amongst other methods.\n            \n            \n              Findings\n              The first version appeared online 12 years ago and has been maintained and further developed ever since, with many new features and improvements added over the years. The SAMtools and BCFtools packages represent a unique collection of tools that have been used in numerous other software projects and countless genomic pipelines.\n            \n            \n              Conclusion\n              Both SAMtools and BCFtools are freely available on GitHub under the permissive MIT licence, free for both non-commercial and commercial use. Both packages have been installed &gt;1 million times via Bioconda. The source code and documentation are available from https://www.htslib.org.","author":[{"family":"Danecek","given":"Petr"},{"family":"Bonfield","given":"James K"},{"family":"Liddle","given":"Jennifer"},{"family":"Marshall","given":"John"},{"family":"Ohan","given":"Valeriu"},{"family":"Pollard","given":"Martin O"},{"family":"Whitwham","given":"Andrew"},{"family":"Keane","given":"Thomas"},{"family":"McCarthy","given":"Shane A"},{"family":"Davies","given":"Robert M"},{"family":"Li","given":"Heng"}],"citation-key":"danecekTwelveYearsSAMtools2021","container-title":"GigaScience","container-title-short":"GigaScience","DOI":"10.1093/gigascience/giab008","ISSN":"2047-217X","issue":"2","issued":{"date-parts":[["2021",1,29]]},"language":"en-US","page":"giab008","PMCID":"PMC7931819","PMID":"33590861","source":"PubMed","title":"Twelve years of SAMtools and BCFtools","type":"article-journal","URL":"https://academic.oup.com/gigascience/article/doi/10.1093/gigascience/giab008/6137722","volume":"10"},
  {"id":"danecekVariantCallFormat2011","abstract":"Abstract\n            Summary: The variant call format (VCF) is a generic format for storing DNA polymorphism data such as SNPs, insertions, deletions and structural variants, together with rich annotations. VCF is usually stored in a compressed manner and can be indexed for fast data retrieval of variants from a range of positions on the reference genome. The format was developed for the 1000 Genomes Project, and has also been adopted by other projects such as UK10K, dbSNP and the NHLBI Exome Project. VCFtools is a software suite that implements various utilities for processing VCF files, including validation, merging, comparing and also provides a general Perl API.\n            Availability:  http://vcftools.sourceforge.net\n            Contact:  rd@sanger.ac.uk","author":[{"family":"Danecek","given":"Petr"},{"family":"Auton","given":"Adam"},{"family":"Abecasis","given":"Goncalo"},{"family":"Albers","given":"Cornelis A."},{"family":"Banks","given":"Eric"},{"family":"DePristo","given":"Mark A."},{"family":"Handsaker","given":"Robert E."},{"family":"Lunter","given":"Gerton"},{"family":"Marth","given":"Gabor T."},{"family":"Sherry","given":"Stephen T."},{"family":"McVean","given":"Gilean"},{"family":"Durbin","given":"Richard"},{"literal":"1000 Genomes Project Analysis Group"}],"citation-key":"danecekVariantCallFormat2011","container-title":"Bioinformatics","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/btr330","ISSN":"1367-4811, 1367-4803","issue":"15","issued":{"date-parts":[["2011",8,1]]},"language":"en-US","page":"2156-2158","source":"DOI.org (Crossref)","title":"The variant call format and VCFtools","type":"article-journal","URL":"https://academic.oup.com/bioinformatics/article/27/15/2156/402296","volume":"27"},
  {"id":"deraadSnpfiltrPackageInteractive2022","abstract":"Here, I describe the R package snpfiltr and demonstrate its functionality as the backbone of a customizable, reproducible single nucleotide polymorphism (SNP) filtering pipeline implemented exclusively via the widely adopted R programming language. SNPfiltR extends existing SNP filtering functionalities by automating the visualization of key parameters such as sequencing depth, quality, and missing data proportion, allowing users to visually optimize and implement filtering thresholds within a single, cohesive work session. All SNPfiltR functions require vcfr objects as input, which can be easily generated by reading a SNP data set stored in standard variant call format (vcf) into an R working environment using the function read.vcfR() from the R package vcfr. Performance and accuracy benchmarking reveal that for moderately sized SNP data sets (up to 50 M genotypes, plus associated quality information), SNPfiltR performs filtering with comparable accuracy and efficiency to current state of the art command-line-based programs. These results indicate that for most reduced-representation genomic data sets, SNPfiltR is an ideal choice for investigating, visualizing, and filtering SNPs as part of a user friendly bioinformatic pipeline. The snpfiltr package can be downloaded from CRAN with the command install.packages(“snpfiltr”), and the current development version is available from GitHub at: (github.com/DevonDeRaad/SNPfiltR). Thorough documentation for SNPfiltR, including multiple comprehensive vignettes detailing realistic use-cases, is available at the website: devonderaad.github.io/SNPfiltR/.","accessed":{"date-parts":[["2023",6,5]]},"author":[{"family":"DeRaad","given":"Devon A."}],"citation-key":"deraadSnpfiltrPackageInteractive2022","container-title":"Molecular Ecology Resources","container-title-short":"Mol. Ecol. Resour.","DOI":"10.1111/1755-0998.13618","ISSN":"1755-098X, 1755-0998","issue":"6","issued":{"date-parts":[["2022",8]]},"language":"en-US","license":"© 2022 John Wiley & Sons Ltd.","page":"2443-2453","source":"Wiley Online Library","title":"snpfiltr: An R package for interactive and reproducible SNP filtering","title-short":"snpfiltr","type":"article-journal","URL":"https://onlinelibrary.wiley.com/doi/abs/10.1111/1755-0998.13618","volume":"22"},
  {"id":"jainLongreadMappingRepetitive2022","abstract":"Approximately 5–10% of the human genome remains inaccessible due to the presence of repetitive sequences such as segmental duplications and tandem repeat arrays. We show that existing long-read mappers often yield incorrect alignments and variant calls within long, near-identical repeats, as they remain vulnerable to allelic bias. In the presence of a nonreference allele within a repeat, a read sampled from that region could be mapped to an incorrect repeat copy. To address this limitation, we developed a new long-read mapping method, Winnowmap2, by using minimal confidently alignable substrings. Winnowmap2 computes each read mapping through a collection of confident subalignments. This approach is more tolerant of structural variation and more sensitive to paralog-specific variants within repeats. Our experiments highlight that Winnowmap2 successfully addresses the issue of allelic bias, enabling more accurate downstream variant calls in repetitive sequences.","accessed":{"date-parts":[["2025",8,3]]},"author":[{"family":"Jain","given":"Chirag"},{"family":"Rhie","given":"Arang"},{"family":"Hansen","given":"Nancy F."},{"family":"Koren","given":"Sergey"},{"family":"Phillippy","given":"Adam M."}],"citation-key":"jainLongreadMappingRepetitive2022","container-title":"Nature Methods","container-title-short":"Nat. Methods","DOI":"10.1038/s41592-022-01457-8","ISSN":"1548-7105","issue":"6","issued":{"date-parts":[["2022",6]]},"language":"en","license":"2022 The Author(s), under exclusive licence to Springer Nature America, Inc.","page":"705-710","publisher":"Nature Publishing Group","source":"www.nature.com","title":"Long-read mapping to repetitive reference sequences using Winnowmap2","type":"article-journal","URL":"https://www.nature.com/articles/s41592-022-01457-8","volume":"19"},
  {"id":"jombartAdegenet31New2011","abstract":"Abstract.  Summary: While the R software is becoming a standard for the analysis of genetic data, classical population genetics tools are being challenged by th","accessed":{"date-parts":[["2020",6,9]]},"author":[{"family":"Jombart","given":"Thibaut"},{"family":"Ahmed","given":"Ismaïl"}],"citation-key":"jombartAdegenet31New2011","container-title":"Bioinformatics","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/btr521","ISSN":"1367-4803","issue":"21","issued":{"date-parts":[["2011",11,1]]},"language":"en","page":"3070-3071","publisher":"Oxford Academic","source":"academic.oup.com","title":"adegenet 1.3-1: new tools for the analysis of genome-wide SNP data","title-short":"adegenet 1.3-1","type":"article-journal","URL":"https://academic.oup.com/bioinformatics/article/27/21/3070/218892","volume":"27"},
  {"id":"jombartAdegenetPackageMultivariate2008","abstract":"Abstract.  Summary: The package adegenet for the R software is dedicated to the multivariate analysis of genetic markers. It extends the ade4 package of multiva","accessed":{"date-parts":[["2020",6,9]]},"author":[{"family":"Jombart","given":"Thibaut"}],"citation-key":"jombartAdegenetPackageMultivariate2008","container-title":"Bioinformatics","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/btn129","ISSN":"1367-4803","issue":"11","issued":{"date-parts":[["2008",6,1]]},"language":"en","page":"1403-1405","publisher":"Oxford Academic","source":"academic.oup.com","title":"adegenet: a R package for the multivariate analysis of genetic markers","title-short":"adegenet","type":"article-journal","URL":"https://academic.oup.com/bioinformatics/article/24/11/1403/191127","volume":"24"},
  {"id":"knausVcfrPackageManipulate2017","abstract":"Software to call single-nucleotide polymorphisms or related genetic variants has converged on the variant call format (VCF) as the output format of choice. This has created a need for tools to work with VCF files. While an increasing number of software exists to read VCF data, many only extract the genotypes without including the data associated with each genotype that describes its quality. We created the r package vcfr to address this issue. We developed a VCF file exploration tool implemented in the r language because r provides an interactive experience and an environment that is commonly used for genetic data analysis. Functions to read and write VCF files into r as well as functions to extract portions of the data and to plot summary statistics of the data are implemented. vcfr further provides the ability to visualize how various parameterizations of the data affect the results. Additional tools are included to integrate sequence (fasta) and annotation data (GFF) for visualization of genomic regions such as chromosomes. Conversion functions translate data from the vcfr data structure to formats used by other r genetics packages. Computationally intensive functions are implemented in C++ to improve performance. Use of these tools is intended to facilitate VCF data exploration, including intuitive methods for data quality control and easy export to other r packages for further analysis. vcfr thus provides essential, novel tools currently not available in r.","accessed":{"date-parts":[["2018",1,29]]},"author":[{"family":"Knaus","given":"Brian J."},{"family":"Grünwald","given":"Niklaus J."}],"citation-key":"knausVcfrPackageManipulate2017","container-title":"Molecular Ecology Resources","container-title-short":"Mol Ecol Resour","DOI":"10.1111/1755-0998.12549","ISSN":"1755-0998","issue":"1","issued":{"date-parts":[["2017",1,1]]},"language":"en","page":"44-53","source":"Wiley Online Library","title":"vcfr: a package to manipulate and visualize variant call format data in R","title-short":"vcfr","type":"article-journal","URL":"http://onlinelibrary.wiley.com/doi/10.1111/1755-0998.12549/abstract","volume":"17"},
  {"id":"leeProwlerNovelTrimming2021","abstract":"Trimming and filtering tools are useful in DNA sequencing analysis because they increase the accuracy of sequence alignments and thus the reliability of results. Oxford nanopore technologies (ONT) trimming and filtering tools are currently rudimentary, generally only filtering reads based on whole read average quality. This results in discarding reads that contain regions of high-quality sequence. Here, we propose Prowler, a trimmer that uses a window-based approach inspired by algorithms used to trim short read data. Importantly, we retain the phase and read length information by optionally replacing trimmed sections with Ns.Prowler was applied to mammalian and bacterial datasets, to assess its effect on alignment and assembly, respectively. Compared to data filtered with Nanofilt, alignments of data trimmed with Prowler had lower error rates and more mapped reads. Assemblies of Prowler trimmed data had a lower error rate than those filtered with Nanofilt; however, this came at some cost to assembly contiguity.Prowler is implemented in Python and is available at https://github.com/ProwlerForNanopore/ProwlerTrimmer.Supplementary data are available at Bioinformatics online.","accessed":{"date-parts":[["2025",8,1]]},"author":[{"family":"Lee","given":"Simon"},{"family":"Nguyen","given":"Loan T"},{"family":"Hayes","given":"Ben J"},{"family":"Ross","given":"Elizabeth M"}],"citation-key":"leeProwlerNovelTrimming2021","container-title":"Bioinformatics","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/btab630","ISSN":"1367-4803","issue":"21","issued":{"date-parts":[["2021",11,5]]},"language":"en","page":"3936-3937","source":"Silverchair","title":"Prowler: a novel trimming algorithm for oxford nanopore sequence data","title-short":"Prowler","type":"article-journal","URL":"https://doi.org/10.1093/bioinformatics/btab630","volume":"37"},
  {"id":"liMinimap2PairwiseAlignment2018","abstract":"Recent advances in sequencing technologies promise ultra-long reads of ∼100 kb in average, full-length mRNA or cDNA reads in high throughput and genomic contigs over 100 Mb in length. Existing alignment programs are unable or inefficient to process such data at scale, which presses for the development of new alignment algorithms.Minimap2 is a general-purpose alignment program to map DNA or long mRNA sequences against a large reference database. It works with accurate short reads of ≥100 bp in length, ≥1 kb genomic reads at error rate ∼15%, full-length noisy Direct RNA or cDNA reads and assembly contigs or closely related full chromosomes of hundreds of megabases in length. Minimap2 does split-read alignment, employs concave gap cost for long insertions and deletions and introduces new heuristics to reduce spurious alignments. It is 3–4 times as fast as mainstream short-read mappers at comparable accuracy, and is ≥30 times faster than long-read genomic or cDNA mappers at higher accuracy, surpassing most aligners specialized in one type of alignment.https://github.com/lh3/minimap2Supplementary data are available at Bioinformatics online.","accessed":{"date-parts":[["2025",8,3]]},"author":[{"family":"Li","given":"Heng"}],"citation-key":"liMinimap2PairwiseAlignment2018","container-title":"Bioinformatics","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/bty191","ISSN":"1367-4803","issue":"18","issued":{"date-parts":[["2018",9,15]]},"language":"en","page":"3094-3100","source":"Silverchair","title":"Minimap2: pairwise alignment for nucleotide sequences","title-short":"Minimap2","type":"article-journal","URL":"https://doi.org/10.1093/bioinformatics/bty191","volume":"34"},
  {"id":"liNewStrategiesImprove2021","abstract":"We present several recent improvements to minimap2, a versatile pairwise aligner for nucleotide sequences. Now minimap2 v2.22 can more accurately map long reads to highly repetitive regions and align through insertions or deletions up to 100 kb by default, addressing major weakness in minimap2 v2.18 or earlier.https://github.com/lh3/minimap2.","accessed":{"date-parts":[["2025",8,3]]},"author":[{"family":"Li","given":"Heng"}],"citation-key":"liNewStrategiesImprove2021","container-title":"Bioinformatics","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/btab705","ISSN":"1367-4803","issue":"23","issued":{"date-parts":[["2021",12,7]]},"language":"en","page":"4572-4574","source":"Silverchair","title":"New strategies to improve minimap2 alignment accuracy","type":"article-journal","URL":"https://doi.org/10.1093/bioinformatics/btab705","volume":"37"},
  {"id":"liStatisticalFrameworkSNP2011","abstract":"Abstract\n            Motivation: Most existing methods for DNA sequence analysis rely on accurate sequences or genotypes. However, in applications of the next-generation sequencing (NGS), accurate genotypes may not be easily obtained (e.g. multi-sample low-coverage sequencing or somatic mutation discovery). These applications press for the development of new methods for analyzing sequence data with uncertainty.\n            Results: We present a statistical framework for calling SNPs, discovering somatic mutations, inferring population genetical parameters and performing association tests directly based on sequencing data without explicit genotyping or linkage-based imputation. On real data, we demonstrate that our method achieves comparable accuracy to alternative methods for estimating site allele count, for inferring allele frequency spectrum and for association mapping. We also highlight the necessity of using symmetric datasets for finding somatic mutations and confirm that for discovering rare events, mismapping is frequently the leading source of errors.\n            Availability:  http://samtools.sourceforge.net\n            Contact:  hengli@broadinstitute.org","accessed":{"date-parts":[["2023",6,27]]},"author":[{"family":"Li","given":"Heng"}],"citation-key":"liStatisticalFrameworkSNP2011","container-title":"Bioinformatics","container-title-short":"Bioinformatics","DOI":"10.1093/bioinformatics/btr509","ISSN":"1367-4811, 1367-4803","issue":"21","issued":{"date-parts":[["2011",11,1]]},"language":"en-US","page":"2987-2993","PMCID":"PMC3198575","PMID":"21903627","source":"PubMed Central","title":"A statistical framework for SNP calling, mutation discovery, association mapping and population genetical parameter estimation from sequencing data","type":"article-journal","URL":"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3198575/","volume":"27"},
  {"id":"lshtmdr1765","abstract":"Toolset for the exploration of genetic and genomic data. Adegenet provides formal (S4) classes for storing and handling various genetic data, including genetic markers with varying ploidy and hierarchical population structure ('genind' class), alleles counts by populations ('genpop'), and genome-wide SNP data ('genlight'). It also implements original multivariate methods (DAPC, sPCA), graphics, statistical tests, simulation tools, distance and similarity measures, and several spatial methods. A range of both empirical and simulated datasets is also provided to illustrate various methods.","author":[{"family":"Jombart","given":"Thibaut"},{"family":"Kamvar","given":"Zhian N."},{"family":"Collins","given":"Caitlin"},{"family":"Luštrik","given":"Roman"},{"family":"Beugin","given":"Marie-Pauline"},{"family":"Knaus","given":"Brian J"},{"family":"Solymos","given":"Peter"},{"family":"Mikryukov","given":"Vladimir"},{"family":"Schliep","given":"Klaus"},{"family":"Maié","given":"Tiago"},{"family":"Morkovsky","given":"Libor"},{"family":"Ahmed","given":"Ismail"},{"family":"Cori","given":"Anne"},{"family":"Calboli","given":"Federico"},{"family":"Ewing","given":"RJ"},{"family":"Michaud","given":"Frédéric"},{"family":"DeCamp","given":"Rebecca"},{"family":"Courtiol","given":"Alexandre"}],"citation-key":"lshtmdr1765","issued":{"date-parts":[["2020",5]]},"publisher":"The Comprehensive R Archive Network","title":"adegenet: Exploratory analysis of genetic and genomic data","type":"article-journal","URL":"http://datacompass.lshtm.ac.uk/1765/"},
  {"id":"rudenUsingDrosophilaMelanogaster2012","abstract":"This paper describes a new program SnpSift for filtering differential DNA sequence variants between two or more experimental genomes after genotoxic chemical exposure. Here, we illustrate how SnpSift can be used to identify candidate phenotype-relevant variants including single nucleotide polymorphisms, multiple nucleotide polymorphisms, insertions, and deletions (InDels) in mutant strains isolated from genome-wide chemical mutagenesis of Drosophila melanogaster. First, the genomes of two independently isolated mutant fly strains that are allelic for a novel recessive male-sterile locus generated by genotoxic chemical exposure were sequenced using the Illumina next-generation DNA sequencer to obtain 20- to 29-fold coverage of the euchromatic sequences. The sequencing reads were processed and variants were called using standard bioinformatic tools. Next, SnpEff was used to annotate all sequence variants and their potential mutational effects on associated genes. Then, SnpSift was used to filter and select differential variants that potentially disrupt a common gene in the two allelic mutant strains. The potential causative DNA lesions were partially validated by capillary sequencing of polymerase chain reaction-amplified DNA in the genetic interval as defined by meiotic mapping and deletions that remove defined regions of the chromosome. Of the five candidate genes located in the genetic interval, the Pka-like gene CG12069 was found to carry a separate pre-mature stop codon mutation in each of the two allelic mutants whereas the other four candidate genes within the interval have wild-type sequences. The Pka-like gene is therefore a strong candidate gene for the male-sterile locus. These results demonstrate that combining SnpEff and SnpSift can expedite the identification of candidate phenotype-causative mutations in chemically mutagenized Drosophila strains. This technique can also be used to characterize the variety of mutations generated by genotoxic chemicals.","accessed":{"date-parts":[["2016",11,4]]},"author":[{"family":"Ruden","given":"Douglas Mark"},{"family":"Cingolani","given":"Pablo"},{"family":"Patel","given":"Viral M."},{"family":"Coon","given":"Melissa"},{"family":"Nguyen","given":"Tung"},{"family":"Land","given":"Susan J."},{"family":"Lu","given":"Xiangyi"}],"citation-key":"rudenUsingDrosophilaMelanogaster2012","container-title":"Toxicogenomics","container-title-short":"Drosophila melanogaster","DOI":"10.3389/fgene.2012.00035","issued":{"date-parts":[["2012"]]},"page":"35","source":"Frontiers","title":"Using <i>Drosophila melanogaster</i> as a model for genotoxic chemical mutational studies with a new program, SnpSift","type":"article-journal","URL":"http://journal.frontiersin.org/article/10.3389/fgene.2012.00035/full","volume":"3"},
  {"id":"steinigNanoqUltrafastQuality2022","abstract":"Steinig et al., (2022). Nanoq: ultra-fast quality control for nanopore reads. Journal of Open Source Software, 7(69), 2991, https://doi.org/10.21105/joss.02991","accessed":{"date-parts":[["2023",7,4]]},"author":[{"family":"Steinig","given":"Eike"},{"family":"Coin","given":"Lachlan"}],"citation-key":"steinigNanoqUltrafastQuality2022","container-title":"Journal of Open Source Software","container-title-short":"J. Open Source Softw.","DOI":"10.21105/joss.02991","ISSN":"2475-9066","issue":"69","issued":{"date-parts":[["2022",1,8]]},"language":"en-US","page":"2991","source":"joss.theoj.org","title":"Nanoq: ultra-fast quality control for nanopore reads","title-short":"Nanoq","type":"article-journal","URL":"https://joss.theoj.org/papers/10.21105/joss.02991","volume":"7"},
  {"id":"Tange2011a","author":[{"family":"Tange","given":"O."}],"citation-key":"Tange2011a","container-title":";login: The USENIX Magazine","DOI":"10.5281/zenodo.16303","issue":"1","issued":{"date-parts":[["2011",2]]},"page":"42-47","title":"GNU Parallel - The Command-Line Power Tool","type":"article-journal","URL":"http://www.gnu.org/s/parallel","volume":"36"},
  {"id":"tischlerBiobambamToolsRead2014a","abstract":"Sequence alignment data is often ordered by coordinate (id of the reference sequence plus position on the sequence where the fragment was mapped) when stored in BAM files, as this simplifies the extraction of variants between the mapped data and the reference or of variants within the mapped data. In this order paired reads are usually separated in the file, which complicates some other applications like duplicate marking or conversion to the FastQ format which require to access the full information of the pairs.","accessed":{"date-parts":[["2024",10,2]]},"author":[{"family":"Tischler","given":"German"},{"family":"Leonard","given":"Steven"}],"citation-key":"tischlerBiobambamToolsRead2014a","container-title":"Source Code for Biology and Medicine","container-title-short":"Source Code Biol. Med.","DOI":"10.1186/1751-0473-9-13","ISSN":"1751-0473","issue":"1","issued":{"date-parts":[["2014",12]]},"language":"en-US","page":"13","source":"BioMed Central","title":"biobambam: tools for read pair collation based algorithms on BAM files","title-short":"biobambam","type":"article-journal","URL":"https://doi.org/10.1186/1751-0473-9-13","volume":"9"},
  {"id":"vythalingamCTABDNAExtraction2022","abstract":"This is a comprehensive CTAB extraction protocol intended for DNA extraction of mollusks. It includes detailed methodology and several reagent preparation.","accessed":{"date-parts":[["2025",7,25]]},"author":[{"family":"Vythalingam","given":"Lavanya M."},{"family":"Regan","given":"Tim"},{"family":"Bean","given":"Tim"},{"family":"Peñaloza","given":"Carolina"}],"citation-key":"vythalingamCTABDNAExtraction2022","issued":{"date-parts":[["2022",10,12]]},"language":"en","source":"www.protocols.io","title":"CTAB DNA extraction protocol for mollusks","type":"article-journal","URL":"https://www.protocols.io/view/ctab-dna-extraction-protocol-for-mollusks-cf8ntrve"},
  {"id":"zhengSymphonizingPileupFullalignment2022","abstract":"Deep learning-based variant callers are becoming the standard and have achieved superior single nucleotide polymorphisms calling performance using long reads. Here we present Clair3, which leverages two major method categories: pileup calling handles most variant candidates with speed, and full-alignment tackles complicated candidates to maximize precision and recall. Clair3 runs faster than any of the other state-of-the-art variant callers and demonstrates improved performance, especially at lower coverage.","accessed":{"date-parts":[["2023",5,24]]},"author":[{"family":"Zheng","given":"Zhenxian"},{"family":"Li","given":"Shumin"},{"family":"Su","given":"Junhao"},{"family":"Leung","given":"Amy Wing-Sze"},{"family":"Lam","given":"Tak-Wah"},{"family":"Luo","given":"Ruibang"}],"citation-key":"zhengSymphonizingPileupFullalignment2022","container-title":"Nature Computational Science","container-title-short":"Nat. Comput. Sci.","DOI":"10.1038/s43588-022-00387-x","ISSN":"2662-8457","issue":"12","issued":{"date-parts":[["2022",12,19]]},"language":"en-US","license":"2022 The Author(s), under exclusive licence to Springer Nature America, Inc.","number":"12","page":"797-803","publisher":"Nature Publishing Group","source":"www.nature.com","title":"Symphonizing pileup and full-alignment for deep learning-based long-read variant calling","type":"article-journal","URL":"https://www.nature.com/articles/s43588-022-00387-x","volume":"2"}
]
